InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_ТипыЭлементовСтратегическогоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ТипыЭлементовСтратегическогоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Цель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Программа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ПраваНаОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПраваНаОбъекты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Просмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редактирование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ИА_АдминшкалаСервер/Ext/Module.bsl
Функция ИзвлечьТекстИзHTML(Знач ИсходныйТекст, ЧиститьТело = ложь) Экспорт
	Результат = "";
	
	Текст = НРег(ИсходныйТекст);
	
	// отрезаем всё что не body
	Позиция = Найти(Текст, "<body");
	Если Позиция > 0 Тогда
		Текст = Сред(Текст, Позиция + 5);
		ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 5);
		Позиция = Найти(Текст, ">");
		Если Позиция > 0 Тогда
			Текст = Сред(Текст, Позиция + 1);
			ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
		КонецЕсли;
	КонецЕсли;
	
	Позиция = Найти(Текст, "</body>");
	Если Позиция > 0 Тогда
		Текст = Лев(Текст, Позиция - 1);
		ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1);
	КонецЕсли;
	
	Если ЧиститьТело Тогда
		// вырезаем скрипты
		Позиция = Найти(Текст, "<script");
		Пока Позиция > 0 Цикл
			ПозицияЗакрывающегоТега = Найти(Текст, "</script>");
			Если ПозицияЗакрывающегоТега = 0 Тогда
				// не найден закрывающий тег - вырезаем оставшийся текст.
				ПозицияЗакрывающегоТега = СтрДлина(Текст);
			КонецЕсли;
			Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + 9);
			ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + 9);
			Позиция = Найти(Текст, "<script");
		КонецЦикла;
		
		// вырезаем стили
		Позиция = Найти(Текст, "<style");
		Пока Позиция > 0 Цикл
			ПозицияЗакрывающегоТега = Найти(Текст, "</style>");
			Если ПозицияЗакрывающегоТега = 0 Тогда
				// не найден закрывающий тег - вырезаем оставшийся текст.
				ПозицияЗакрывающегоТега = СтрДлина(Текст);
			КонецЕсли;
			Текст = Лев(Текст, Позиция - 1) + Сред(Текст, ПозицияЗакрывающегоТега + 8);
			ИсходныйТекст = Лев(ИсходныйТекст, Позиция - 1) + Сред(ИсходныйТекст, ПозицияЗакрывающегоТега + 8);
			Позиция = Найти(Текст, "<style");
		КонецЦикла;
	
	
		// вырезаем все теги	
		Позиция = Найти(Текст, "<");
		Пока Позиция > 0 Цикл
			Результат = Результат + Лев(ИсходныйТекст, Позиция-1);
			Текст = Сред(Текст, Позиция + 1);
			ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
			Позиция = Найти(Текст, ">");
			Если Позиция > 0 Тогда
				Текст = Сред(Текст, Позиция + 1);
				ИсходныйТекст = Сред(ИсходныйТекст, Позиция + 1);
			КонецЕсли;
			Позиция = Найти(Текст, "<");
		КонецЦикла;
	КонецЕсли;
	Результат = Результат + ИсходныйТекст;
	
	Возврат СокрЛП(Результат);
КонецФункции

Процедура ИА_ПриЗаписиЗадачиАШПриЗаписи(Источник, Отказ) Экспорт
	// сейчас это не требуется т.к. только ответственный должен подтвеждать
	
	//Если не Источник.ЭтоПослание Тогда
	//	Если ТипЗнч(Источник.ПрикрепленныйОбъект) = Тип("СправочникСсылка.ИА_СтратегическоеУправление") Тогда 
	//		//Если не Источник.ПрикрепленныйОбъект.Выполнено Тогда
	//			об = Источник.ПрикрепленныйОбъект.ПолучитьОбъект();
	//			об.Выполнено = истина;
	//			об.ДатаВыполнения = ТекущаяДата();
	//			об.Записать();
	//			
	//			ИА_АдминшкалаСервер.СоздатьПосланиеОВыполненииСтратегЗадачи(Источник.ПрикрепленныйОбъект);
	//		//КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если ТипЗнч(Источник.ПрикрепленныйОбъект) = Тип("СправочникСсылка.ИА_СтратегическоеУправление") 
		И ЗначениеЗаполнено(Источник.ПрикрепленныйОбъект)
		И Источник.Выполнена Тогда
		Источник.ЗадачаСУ = Источник.ПрикрепленныйОбъект;
		ЗадачаСУОбъект = Источник.ЗадачаСУ.ПолучитьОбъект();
		ЗадачаСУОбъект.ДатаВыполнения = Источник.ДатаВыполнения;
		ЗадачаСУОбъект.Выполнено = Истина;
		ЗадачаСУОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Функция СоздатьЗадачуСервер(Ответственный, НаименованиеЗадачи, Срок, Содержание, Программа) Экспорт
	Если Ответственный.Пустая() Тогда
		Сообщить("Укажите ответственного за задачу: " + НаименованиеЗадачи);
		Возврат Задачи.ИА_ЗадачаПланаДействий.ПустаяСсылка();
	КонецЕсли;
	Если сокрлп(НаименованиеЗадачи)="" Тогда
		Сообщить("Укажите наименование задачи!");
		Возврат Задачи.ИА_ЗадачаПланаДействий.ПустаяСсылка();
	КонецЕсли;

	НоваяЗадача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
	НоваяЗадача.Автор = ПараметрыСеанса.ТекущийПользователь;
	НоваяЗадача.Дата = ТекущаяДата();
	НоваяЗадача.Наименование = НаименованиеЗадачи;
	НоваяЗадача.Пост = Ответственный;
	НоваяЗадача.Содержание = Содержание + Символы.ПС;
	
	Текрод = Программа.Родитель;
	пока не Текрод.Пустая() Цикл
		если Текрод.ТипЭлемента <> Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.ТипЗадачи Тогда
			НоваяЗадача.Содержание = НоваяЗадача.Содержание + Символы.ПС + Текрод.ТипЭлемента + ": " + Текрод.Наименование;
		КонецЕсли;
		
		Текрод = Текрод.Родитель;
	КонецЦикла;
	НоваяЗадача.СрокИсполнения = Срок;
	НоваяЗадача.ПрикрепленныйОбъект = Программа;
	НоваяЗадача.Отправлена= истина;
	НоваяЗадача.Записать();

	Возврат НоваяЗадача.Ссылка;
КонецФункции

Процедура СоздатьПосланиеОВыполнении(Программа, НаименованиеЗадачи) Экспорт
	Отв = Константы.ИА_ОтветственныйЗаВсеПрограммы.Получить();
	Если отв.Пустая() Тогда
		Сообщить("В настройках не задан ответственный за программы! Отчет не отправлен!");
		Возврат;
	КонецЕсли;
	
	НоваяЗадача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
	НоваяЗадача.ЭтоПослание = Истина;
	НоваяЗадача.Автор = ПараметрыСеанса.ТекущийПользователь;
	НоваяЗадача.Дата = ТекущаяДата();
	НоваяЗадача.Наименование = "Задача """+НаименованиеЗадачи+""" выполнена.";
	//НоваяЗадача.Пост = отв;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИА_АдресацияЗадачПланаДействий.Пользователь
	|ИЗ
	|	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	|ГДЕ
	|	ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пост", Отв);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ПользовательПоста = Выборка.Пользователь;	
	
	НоваяЗадача.Пользователь = ПользовательПоста;	
	НоваяЗадача.Содержание = "Задача """+НаименованиеЗадачи+""" из программы """+Программа+""" выполнена.";
	НоваяЗадача.ПрикрепленныйОбъект = Программа;
	НоваяЗадача.Отправлена = истина;
	НоваяЗадача.Записать();
КонецПроцедуры

Функция ПолучитьПрограммуЗадачи(пЗадача) Экспорт
	Программа = Неопределено;
	Если Не пЗадача.Родитель.Пустая() Тогда
		ТекРод = пЗадача.Родитель;
		
		Пока ЗначениеЗаполнено(ТекРод) Цикл
			Если ТекРод.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Программа Тогда
				Программа = ТекРод;
				Прервать;
			КонецЕсли;
			ТекРод = ТекРод.Родитель;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Программа;
КонецФункции

Функция СоздатьПосланиеОВыполненииСтратегЗадачи(пЗадача) Экспорт
	
	Программа = ПолучитьПрограммуЗадачи(пЗадача);
		
	Если Программа = Неопределено тогда
		Сообщить("Неверная структура данных. Задача не в программе!");
		Возврат ложь;
	КонецЕсли;
	
	Отв = Программа.УведомлятьОВыполнении;
	Если отв.Пустая() Тогда
		Сообщить("В программе не указано кого уведомлять! Отчет не отправлен!");
		Возврат ложь;
	КонецЕсли;
	
	НаименованиеЗадачи = пЗадача.Наименование;
	Если СтрДлина(НаименованиеЗадачи)>70 Тогда
		НаименованиеЗадачи = лев(НаименованиеЗадачи,70)+"...";
	КонецЕсли;
	НаименованиеЗадачи = СтрЗаменить(НаименованиеЗадачи,"<","&lt;");
	НаименованиеЗадачи = СтрЗаменить(НаименованиеЗадачи,">","&gt;");
	
	НаименованиеПрограммы = Программа.наименование;
	НаименованиеПрограммы = СтрЗаменить(НаименованиеПрограммы,"<","&lt;");
	НаименованиеПрограммы = СтрЗаменить(НаименованиеПрограммы,">","&gt;");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИА_АдресацияЗадачПланаДействий.Пользователь
	|ИЗ
	|	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	|ГДЕ
	|	ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пост", Отв);
	Выборка = Запрос.Выполнить().Выбрать();
	Отправлено = ложь;
	Пока Выборка.Следующий() Цикл	
		НоваяЗадача = Задачи.ИА_ЗадачаПланаДействий.СоздатьЗадачу();
		НоваяЗадача.ЭтоПослание = Истина;
		НоваяЗадача.Автор = ПараметрыСеанса.ТекущийПользователь;
		НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.Наименование = "Задача """+НаименованиеЗадачи+""" выполнена.";
			
		НоваяЗадача.Пользователь = Выборка.Пользователь;	
		НоваяЗадача.Содержание = "Задача """+НаименованиеЗадачи+""" из программы """+НаименованиеПрограммы+""" выполнена.";
		//НоваяЗадача.ПрикрепленныйОбъект = пЗадача;
		НоваяЗадача.Отправлена = истина;
		НоваяЗадача.Записать();
		Отправлено = истина;
	КонецЦикла;
	
	Если Отправлено Тогда 
		об = пЗадача.ПолучитьОбъект();
		об.ОтчетОтправлен = истина;
		об.Записать();
	КонецЕсли;

	Возврат Отправлено;
КонецФункции

Функция МожноВыполнитьЗадачу(пСсылка) Экспорт
	программа = ИА_АдминшкалаСервер.ПолучитьПрограммуЗадачи(пСсылка);
	Если программа = Неопределено Тогда 
		Возврат истина;
	КонецЕсли;
	
	Если программа.УведомлятьОВыполнении.Пустая() Тогда 
		Возврат истина;
	КонецЕсли;
	
	Возврат ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПользовательНаПосту(ПараметрыСеанса.ТекущийПользователь, программа.УведомлятьОВыполнении); 
КонецФункции

Процедура ВыполнитьЗадачуВПрограмме(Программа, НомерСтроки) Экспорт
	ПрОбъект = Программа.ПолучитьОбъект();
	ПрОбъект.Задачи[НомерСтроки-1].Выполнено = истина;
	ПрОбъект.Задачи[НомерСтроки-1].ДатаВыполнения = ТекущаяДата();
	ПрОбъект.Записать();
	
	Если (не ПрОбъект.Задачи[НомерСтроки-1].Задача.Пустая()) и не ПрОбъект.Задачи[НомерСтроки-1].Задача.Выполнена Тогда
		ЗавершитьЗадачу(ПрОбъект.Задачи[НомерСтроки-1].Задача);
	КонецЕсли;
КонецПроцедуры

Процедура ЗавершитьЗадачу(пЗадача) Экспорт
	зОбъект = пЗадача.ПолучитьОбъект();
	зОбъект.ДатаВыполнения = ТекущаяДата();
	Новстр = зОбъект.ХодВыполнения.Вставить(0);
	Новстр.Дата = ТекущаяДата();
	Новстр.Комментарий = "Задача завершена";
	Новстр.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	зОбъект.Отложена = Ложь;

	зОбъект.ВыполнитьЗадачу();
КонецПроцедуры

Функция ПолучитьПравоНаОбъект(пСсылка) Экспорт
	ТекПольз = ПараметрыСеанса.ТекущийПользователь;
	
	Если пСсылка.Права.Количество() = 0 или пСсылка.Автор = ТекПольз Тогда 
		Возврат Перечисления.ИА_ПраваНаОбъекты.Редактирование;
	КонецЕсли;
	
	Нстр = пСсылка.Права.найти(ТекПольз);
	Если Нстр <> Неопределено Тогда
		Если НСтр.Редактирование Тогда
			возврат Перечисления.ИА_ПраваНаОбъекты.Редактирование;
		ИначеЕсли НСтр.Просмотр Тогда 
			возврат Перечисления.ИА_ПраваНаОбъекты.Просмотр;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Неопределено;
КонецФункции

Функция ЕстьПравоЧтения(пСсылка) Экспорт
	Право = ПолучитьПравоНаОбъект(пСсылка);
	возврат Право<>Неопределено;
КонецФункции

Функция ПолучитьТаблицуИерархииСУ() Экспорт
	рез = Новый ТаблицаЗначений;
	рез.Колонки.Добавить("ТипЭлемента");
	рез.Колонки.Добавить("ПодчиненныйТип");
	
	макет = ПолучитьОбщийМакет("ИА_ИерархияСтрУправления");
	сч = 1;
	ИмяТипа = СокрЛП(Макет.Область(сч,1,сч,1).Текст);
	ДостЭл = СокрЛП(Макет.Область(сч,2,сч,2).Текст);
	Пока ИмяТипа <> "" Цикл
		Если ДостЭл <> "" Тогда
			тд = Новый ТекстовыйДокумент;
			тд.УстановитьТекст(ДостЭл);
			
			для счЭл = 1 По тд.КоличествоСтрок() Цикл
				текСтрока = СокрЛП(тд.ПолучитьСтроку(счЭл));
				Если текСтрока <> "" Тогда
					Новстр = рез.Добавить();
					Если ИмяТипа = "Пустой" Тогда
						Новстр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.ПустаяСсылка();
					Иначе
						Новстр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления[ИмяТипа];
					КонецЕсли;
					Новстр.ПодчиненныйТип = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления[текСтрока];;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
		сч = сч + 1;
		ИмяТипа = СокрЛП(Макет.Область(сч,1,сч,1).Текст);
		ДостЭл = СокрЛП(Макет.Область(сч,2,сч,2).Текст);
	КонецЦикла;
	
	возврат рез;
КонецФункции

Функция ПолучитьВозможныхПодчиненныхТипов(пЭлементСУ) Экспорт
	тз = ПолучитьТаблицуИерархииСУ();
	Отбор = Новый Структура("ТипЭлемента", пЭлементСУ.ТипЭлемента);
	резСтр = тз.НайтиСтроки(Отбор);
	Рез = Новый массив;
	Для каждого стр из резСтр Цикл
		если ЗначениеЗаполнено(стр.ПодчиненныйТип) ТОгда
			рез.Добавить(стр.ПодчиненныйТип);
		КонецЕсли;
	КонецЦикла;
	
	возврат рез;
КонецФункции

Функция ПолучитьОтветственногоПрограммы(прогр) Экспорт
	Возврат прогр.УведомлятьОВыполнении;
КонецФункции

Функция ПолучитьНаименованиеПрограммы(прогр) Экспорт
	Возврат прогр.Наименование;
КонецФункции

Функция ПолучитьСодержание(прогр) Экспорт
	Возврат прогр.Содержание;
КонецФункции

Процедура ЗавершитьЗадачуАШ(пЗадача) Экспорт
	пЗадачаОб = пЗадача.ПолучитьОбъект();
	пЗадачаОб.Выполнено = истина;
	пЗадачаОб.ДатаВыполнения = ТекущаяДата();
	пЗадачаОб.Записать();
	
	Если (не пЗадачаОб.Задача.Пустая()) и не пЗадачаОб.Задача.Выполнена Тогда
		ЗавершитьЗадачу(пЗадачаОб.Задача);
	КонецЕсли;
КонецПроцедуры
